       >>SOURCE FORMAT FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBDATFT.
       DATA DIVISION.
       LINKAGE SECTION.
       01 DATE-AREA PIC X(79).
       PROCEDURE DIVISION USING DATE-AREA.
           MOVE DATE-AREA(2:20) TO DATE-AREA(23:20)
           GOBACK.
