       01  EBCDIC-TO-ASCII.
           05 EBCDIC-BLOCK-01 PIC X(16) VALUE
              X'000102033F093F7F3F3F3F0B0C0D0E0F'.
           05 EBCDIC-BLOCK-02 PIC X(16) VALUE
              X'101112133F3F083F18193F3F1C1D1E1F'.
           05 EBCDIC-BLOCK-03 PIC X(16) VALUE
              X'3F3F3F3F3F0A171B3F3F3F3F3F050607'.
           05 EBCDIC-BLOCK-04 PIC X(16) VALUE
              X'3F3F163F3F3F3F043F3F3F3F14153F1A'.
           05 EBCDIC-BLOCK-05 PIC X(16) VALUE
              X'203F3F3F3F3F3F3F3F3F2E3C282B7C26'.
           05 EBCDIC-BLOCK-06 PIC X(16) VALUE
              X'3F3F3F3F3F3F3F3F3F21242A293B3F2D'.
           05 EBCDIC-BLOCK-07 PIC X(16) VALUE
              X'2F3F3F3F3F3F3F3F3F3F3F3F2C255F3E'.
           05 EBCDIC-BLOCK-08 PIC X(16) VALUE
              X'3F3F3F3F3F3F3F3F3F603A2340273D22'.
           05 EBCDIC-BLOCK-09 PIC X(16) VALUE
              X'3F6162636465666768693F3F3F3F3F3F'.
           05 EBCDIC-BLOCK-10 PIC X(16) VALUE
              X'3F6A6B6C6D6E6F7071723F3F3F3F3F3F'.
           05 EBCDIC-BLOCK-11 PIC X(16) VALUE
              X'3F7E737475767778797A3F3F3F3F3F3F'.
           05 EBCDIC-BLOCK-12 PIC X(16) VALUE
              X'5E3F3F3F3F3F3F3F3F3F5B5D3F3F3F3F'.
           05 EBCDIC-BLOCK-13 PIC X(16) VALUE
              X'7B4142434445464748493F3F3F3F3F3F'.
           05 EBCDIC-BLOCK-14 PIC X(16) VALUE
              X'7D4A4B4C4D4E4F5051523F3F3F3F3F3F'.
           05 EBCDIC-BLOCK-15 PIC X(16) VALUE
              X'5C3F535455565758595A3F3F3F3F3F3F'.
           05 EBCDIC-BLOCK-16 PIC X(16) VALUE
              X'303132333435363738393F3F3F3F3F3F'.
